{"sections":{"banner":{"type":"banner","disabled":true,"settings":{"image_darken":false,"subtitle":"Subheading","width":"wide","banner_height":"medium","padding_top":0,"padding_bottom":0,"css_class":"","custom_css":""}},"page":{"type":"page-content__main","disabled":true,"settings":{"show_heading":false,"heading_alignment":"left","width":"wide","padding_top":40,"padding_bottom":0,"css_class":"","custom_css":""}},"main":{"type":"index__faq","blocks":{"59f1fd18-465e-4fcd-b67a-cb73be7838ef":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/FAQ_1000x1000_image_1.jpg"}},"16306825309648acac-0":{"type":"heading","settings":{"title":"General FAQs"}},"7525cd75-8a93-47dc-be9a-dae37664f317":{"type":"content","settings":{"title":"Do you ship Internationally from the USA?","answer":"<p>Yes, we use Markets Pro which makes it easy to sell internationally by reducing the complexity of cross-border selling by taking care of local regulations, taxes, duties, international shipping, and localization for each of the 128 international markets in which we sell.<\/p><p>Note: Our gold cannot be shipped to Russia, India, Mexico, Kuwait, Indonesia, Switzerland, Brazil nor Portugal. <\/p>"}},"16306825309648acac-1":{"type":"content","settings":{"title":"How do I clean my Plated & E-Coated jewelry?","answer":"<p>Our jewelry is crafted for longevity, and with proper care, you can preserve its beauty for years to come. Just wipe it with a soft-cloth dampened with water, and make sure to dry it completely. Avoid using harsh chemicals or abrasive materials. <\/p><p>We recommend putting on your jewelry AFTER using hairspray, lotions or perfumes, etc.<\/p><p>Protect the E-Coat and your purchase will last & last.<\/p><p>Deeper read: Our plated jewelry has a clear E-Coat which adds longevity, durability and luster to their surfaces. Soap suds from handwashing are best to recharge your jewelry piece's original luster even if the e-coating wears away over time. *Protect the plate - your last layer of defense, because when its gone the brass is exposed which tarnishes. It's a layering game. <\/p>"}},"16306825309648acac-2":{"type":"content","settings":{"title":"Does the jewelry designer actually make or touch each piece?","answer":"<p>Yes, each jewelry piece is worked on by JAREDJAMIN himself. Only precious metal plating and e-coating are done off-site as it both require jewelry being placed in a series of hot baths with electricity to become plated.<\/p>"}},"16a7001b-e5e4-4795-96d0-5924fc7fa688":{"type":"content","settings":{"title":"In a few photos, the gold looks different than in some others, why?","answer":"<p>In 2021 we hired one product photographer to master & consistently deliver the most realistic photographic representations of our plated jewelry designs. His work is featured on this page and his is most of the photography in NEW ARRIVALS.<\/p><p>Even better is to try our jewelry on in-person at <a href=\"\/pages\/designer-jewellery-ourstockists\" title=\"Our Stockists\">stores carrying our Jewelry<\/a> or to rely on our generous Return Policy. <\/p>"}},"16306825309648acac-4":{"type":"heading","settings":{"title":"Product FAQs"}},"16306825309648acac-5":{"type":"content","settings":{"title":"Where is your jewelry made?","answer":"<p>All our jewelry and accessories are made in our West Hollywood, CA design studio. Those requiring plating are done off-site due to the high temperatures, electricity and tanks required to do so.<\/p>"}},"16306825309648acac-3":{"type":"content","settings":{"title":"What is your repair policy?","answer":"<p>To request a repair please email <span style=\"text-decoration:underline\"><em>JaredJamin at gmail com<\/em><\/span><em> Subject 'REPAIR'<\/em> and be sure to include your name (not just your email), telephone number, original Order Confirmation Number of your order which serves as your receipt, and a brief description of the problem. We will respond with instructions on how to proceed within 48 hours ex​empting​ Weekends & Holidays.<\/p><p>For items <em>purchased<\/em> within forty-five days (45), repairs are free of charge. If your purchase through us directly is older than forty-five days (45) you will be charged a $45 base price for the repair which may be subject to additional repair and or re​-​plating costs​ which will be determined after receiving the piece at our design studio. All repairs are subject to shipping charges and tax.​<\/p><p>All repairs are subject to shipping charges and tax by the purchaser.<\/p><p>For items bought through one of our retailers, please return the damaged item to the store where it was purchased. We defer to each retailer’s return policy in this case. <\/p>"}},"976884d3-8828-44b3-8b3d-1258b85010c6":{"type":"content","settings":{"title":"Do you sell 'adjustable necklaces'?","answer":"<p>Finding the right necklace length can be frustrating, especially if you <br\/>love a particular chain but can only wear it with certain necklines or <br\/>pendants. Adjustable necklaces are the perfect solution and can help make a more versatile jewelry collection. <\/p><p>JAREDJAMIN offers two: <\/p><p>One, the classic chain with extender rings aka jump rings located at approx the 18”, 20”, and 22” points for varying lengths. We hand solder the required 2 inch chain pieces to attached to the jump rings at each length point. <\/p><p>Two, is a regular necklace chain with an attached 2-4 inch piece of a <br\/>larger link chain.  This allows for more size options than the first, as<br\/>often this type can be adjusted to any length between moving in bewteen the chain links in a range typically of 18 to 22 inches.<\/p><p><\/p>"}},"16306825309648acac-6":{"type":"content","settings":{"title":"Why does the 'Silver' Plated Jewelry look like Sterling Silver or Platinum?","answer":"<p>It's because our Silver Jewelry is Plated with our signature white bronze. White bronze is a durable metal and shines like polished sterling silver or white gold. It’s highly reflective, hypoallergenic (aka nickel-free), and holds the distinction of most closely resembling one of the most expensive precious metals in the world, white rhodium which incidentally is about three times more expensive than 24K Gold.<\/p><p>Interestingly, white bronze is not actually bronze. It is an alloy consisting of a combination of copper, tin and zinc. Tri-metal alloys are platinum in color, similar to bright nickel, rhodium and of course, silver. They are all extremely resistant to tarnish and corrosion. <\/p><p>So, unlike Silver, white bronze will not easily tarnish, corrode nor breakdown. <\/p><p>And remember, we clear E-coat all our plated pieces, giving them a clear protective gloss too.<\/p>"}},"16306825309648acac-7":{"type":"content","settings":{"title":"What's the difference between Plating vs. Tone?","answer":"<p>Our jewelry is NOT toned aka 'painted'. <\/p><p>We electroplate our copper and brass designs with a micron (1 µ) thick of either 18K Gold (in an acid gold bath), or Silver (white bronze) plate that yields our signature Silver-look.<\/p><p>Our plating won't wear off in the foreseeable future and if it did then discoloration or tarnishing would occur though slowly as the small ratio of copper in the base alloy would do so.<\/p><p>On top of the above, all of our plated jewelry is clear E-coated for durability and added luster or gloss.<\/p><p>* Preserve your E-coating and plating with ONLY Soap & Water cleaning!<\/p>"}},"cf86b410-c96d-41fb-9f52-f47bdf1bda0c":{"type":"content","settings":{"title":"What is a preservative E-Coat?","answer":"<p>Our E-coat is a shield like a clear coat on one's fingernails after a manicure. Its' an added clear barrier to keep your jewelry lusty, polished and shinning by offering durability and preservation of the plating. <\/p><p>Note: If our jewelry was not E-coated, then it still would not tarnish because our 18K Gold plating is done with an acid gold bath and our Silver (white bronze) is electroplated.<\/p><p>Only if the plating wears off would the alloy below which consists of some copper then, and only then have discoloration or tarnishing. <\/p>"}},"54408302-5169-4e02-8ead-e8c0b811002e":{"type":"content","settings":{"title":"Is all JAREDJAMIN jewelry E-Coated?","answer":"<p>All of JAREDJAMIN plated jewelry has a clear E-coat to protect the 18K gold or Silver (white bronze) plating.<\/p>"}},"bbff3a63-b553-46c8-8dcc-deb02ca828e1":{"type":"content","settings":{"title":"Can you Replate my non JAREDJAMIN jewelry to match my new pieces?","answer":"<p>Yes. For every two pieces of JAREDJAMIN jewelry you buy from us online, we'll then attempt to re-plate one of your personal or legacy pieces of jewelry to match your new purchase with us.<\/p><p>Please send us photos to jaredjamin at gmail dot com first of what you intend to send for careful evaluation if you wish to take advantage of this offer.<\/p><p>This offer does not include repairs nor does it cover your shipping fees to us.<\/p><p>Replating is a way we help fight for our environment by bringing back or refreshing what was less regarded from the past and giving it a bright, fresh, new future in our signature plates.<\/p>"}},"a9f0143e-e7d1-4783-9548-69a875115c9a":{"type":"heading","settings":{"title":"Receiving My Jewelry FAQs"}},"d0b3e00b-d347-4570-82e5-b157cfd9f124":{"type":"content","settings":{"title":"How fast do Orders which are In-Stock ship out?","answer":"<p>Typically, once payment is made we ship out in 2-3 business days if the jewelry is in stock.<\/p>"}},"1a945d31-4072-429c-9674-e58f221c3b73":{"type":"content","settings":{"title":"What are Pre-Orders & How do they work?","answer":"<p>When Pre-Ordering you can expect your jewelry to arrive within 14 business days because we need to custom make another limited supply. <\/p>"}},"fe9e0171-0c08-4eba-b951-2cbc81494186":{"type":"content","settings":{"title":"Does JAREDJAMIN offer Gift Wrapping & a Handwritten Card?","answer":"<p>We'll work with you via FaceTime to pick out wrapping and can also text or email as required. Make sure in your checkout to select 'Gift Wrapping' before making your purchase.<\/p>"}}},"block_order":["59f1fd18-465e-4fcd-b67a-cb73be7838ef","16306825309648acac-0","7525cd75-8a93-47dc-be9a-dae37664f317","16306825309648acac-1","16306825309648acac-2","16a7001b-e5e4-4795-96d0-5924fc7fa688","16306825309648acac-4","16306825309648acac-5","16306825309648acac-3","976884d3-8828-44b3-8b3d-1258b85010c6","16306825309648acac-6","16306825309648acac-7","cf86b410-c96d-41fb-9f52-f47bdf1bda0c","54408302-5169-4e02-8ead-e8c0b811002e","bbff3a63-b553-46c8-8dcc-deb02ca828e1","a9f0143e-e7d1-4783-9548-69a875115c9a","d0b3e00b-d347-4570-82e5-b157cfd9f124","1a945d31-4072-429c-9674-e58f221c3b73","fe9e0171-0c08-4eba-b951-2cbc81494186"],"settings":{"title":"","width":"wide","padding_top":0,"padding_bottom":80,"animation":"none","padding_top_mobile":56,"padding_bottom_mobile":56,"css_class":"","custom_css":""}}},"order":["banner","page","main"]}